/*
Автор проекту: Суптеля Владислав
Дата: 18.10.2019
19.Введіть з клавіатури і виведіть на екран одну букву російського алфавіту. У разі введення не російською букви надрукуйте повідомлення про помилку на екрані і завершите виконання програми.
*/

#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	cout << "Введите букву русского алфавита . . ." << endl;
	char x;
	cin >> x;
	if ((unsigned int) x < 192)
	{
		MessageBox(NULL, "Букву. Русского. Алфавита.", "Ошибка", MB_OK);
		return 0;
	}
	else
	{
		cout << x; // вывод кривой
		return 0;
	}
}