/*
	Автор: Суптеля Владислав
	Дата: 4.10.2019
	13.Виведіть на екран всі прописні букви і їх номери.
*/
#include <iostream>
using namespace std;

/*
| Char  Dec  Oct  Hex | Char Dec  Oct   Hex
-------------------------------------------
| A      65 0101 0x41 | a      97 0141 0x61
| B      66 0102 0x42 | b      98 0142 0x62
| C      67 0103 0x43 | c      99 0143 0x63
| D      68 0104 0x44 | d     100 0144 0x64
| E      69 0105 0x45 | e     101 0145 0x65
| F      70 0106 0x46 | f     102 0146 0x66
| G      71 0107 0x47 | g     103 0147 0x67
| H      72 0110 0x48 | h     104 0150 0x68
| I      73 0111 0x49 | i     105 0151 0x69
| J      74 0112 0x4a | j     106 0152 0x6a
| K      75 0113 0x4b | k     107 0153 0x6b
| L      76 0114 0x4c | l     108 0154 0x6c
| M      77 0115 0x4d | m     109 0155 0x6d
| N      78 0116 0x4e | n     110 0156 0x6e
| O      79 0117 0x4f | o     111 0157 0x6f
| P      80 0120 0x50 | p     112 0160 0x70
| Q      81 0121 0x51 | q     113 0161 0x71
| R      82 0122 0x52 | r     114 0162 0x72
| S      83 0123 0x53 | s     115 0163 0x73
| T      84 0124 0x54 | t     116 0164 0x74
| U      85 0125 0x55 | u     117 0165 0x75
| V      86 0126 0x56 | v     118 0166 0x76
| W      87 0127 0x57 | w     119 0167 0x77
| X      88 0130 0x58 | x     120 0170 0x78
| Y      89 0131 0x59 | y     121 0171 0x79
| Z      90 0132 0x5a | z     122 0172 0x7a
*/
int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	for (int i = 65; i <= 90; i++) // заглавные инглиша ещё со времён ASCII
		cout << "Номер символа " << char(i) << " - " << i << endl;
	for (int i = 97; i <= 122; i++) // строчные инглиша
		cout << "Номер символа " << char(i) << " - " << i << endl;
	for (int i = 192; i <= 223; i++) // заглавные кириллицы
		cout << "Номер символа " << unsigned char(i) << " - " << i << endl;
	for (int i = 224; i <= 255; i++) // строчные кириллицы
		cout << "Номер символа " << char(i) << " - " << i << endl;
	system("pause");
	return 0;
}