# 141, Суптеля Владислав
# 【Дата】:「24.02.20」
# 2. Дано три цілих числа. Знайти кількість додатних чисел в початковому наборі.

print("Умова: Дано три цілих числа. Знайти кількість додатних чисел в початковому наборі.")
a, b, c = map(int, input("Значення「A」, 「B」, 「C」: ").split()); q = int(0)
if a > 0: q += 1
if b > 0: q += 1
if c > 0: q += 1
print("【Положительных чисел】 => {0}".format(q))
