# 141, Суптеля Владислав
# 【Дата】:「24.02.20」
# 7. Одиниці маси пронумеровані в такий спосіб: 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 - центнер.
# Дано номер одиниці маси (ціле число в діапазоні 1-5) і маса тіла в цих одиницях (дійсне число). Знайти масу тіла в кілограмах.

print("Умова: Знайти масу тіла в кілограмах.")
a, b = map(int, input("Значення「A」(номер одиницi маси, 1-5), 「B」(маса): ").split()); m = int(0)
if a == 1: m += b          # кг
if a == 2: m += b/1000000  # мг
if a == 3: m += b/1000     # г
if a == 4: m += b*1000     # т
if a == 5: m += b*100      # цт
# можно через "mydict = {}" . . .
print("【Масса】(кг) => {0}".format(m))
