# 141, Суптеля Владислав
# 【Дата】:「24.02.20」
# 12. Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1, 2, ..., 10 кг цукерок.

print("Умова: Вивести вартість цукерок.")
a, b = map(float, input("Значення「A」(цiна за кг), 「B」(маса): ").split())
print("【Цiна】(грн) => {0}".format(a*b))
