# 141, Суптеля Владислав
# 【Дата】:「19.03.20」
# 2. Описати рекурсивную функцію Fact2 (N) дійсного типу, яка обчислює значення подвійного факторіала N !! = N • (N-2) • (N-4) • ...
# (N> 0 - параметр цілого типу; останній співмножник в творі дорівнює 2, якщо N - парне число, і 1, якщо N - непарне).
# За допомогою цієї функції обчислити подвійні факторіали п'яти довільних натуральних чисел.

import random

def double_factorial(n):
    if n <= 0:
        return 1
    else:
        return n * double_factorial(n - 2)

for i in range(0, 5):
    num = random.randint(1, 10)
    print(f'Подвiйний факторiал {num} = {double_factorial(num)}')
