# 141, Суптеля Владислав
# 【Дата】:「19.03.20」
# 4. Описати рекурсивную функцію Fib1 (N) цілого типу, яка обчислює N-й елемент послідовності чисел Фібоначчі (N - ціле число):
# F1 = F2 = 1, FK = FK-2 + FK-1, K = 3, 4, ....
# За допомогою цієї функції знайти п'ять чисел Фібоначчі з даними номерами, і вивести ці числа
# разом з кількістю рекурсивних викликів функції Fib1, потребовавшихся для їх знаходження.

ctr = 0  # счётчик

def fib1(n):
    global ctr
    ctr += 1

    if n in (1, 2):
        return 1
    return fib1(n - 1) + fib1(n - 2)

n = int(input('N = '))
result = [fib1(i) for i in range(1, n+1)]
print(result)
print('Число викликiв {Fib1}:', ctr)

