-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Мар 16 2021 г., 14:50
-- Версия сервера: 10.4.17-MariaDB
-- Версия PHP: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test_database`
--

-- --------------------------------------------------------

--
-- Структура таблицы `table_1`
--

CREATE TABLE `table_1` (
  `N` smallint(3) NOT NULL,
  `Код` smallint(4) NOT NULL,
  `Новинка` varchar(3) NOT NULL DEFAULT 'No',
  `Назва` varchar(255) NOT NULL,
  `Цiна` float(6,2) DEFAULT NULL,
  `Видавництво` varchar(255) NOT NULL,
  `Сторiнки` smallint(4) DEFAULT NULL,
  `Формат` varchar(20) DEFAULT NULL,
  `Дата` date DEFAULT NULL,
  `Тираж` int(10) DEFAULT NULL,
  `Тема` varchar(255) DEFAULT NULL,
  `Категорiя` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `table_1`
--

INSERT INTO `table_1` (`N`, `Код`, `Новинка`, `Назва`, `Цiна`, `Видавництво`, `Сторiнки`, `Формат`, `Дата`, `Тираж`, `Тема`, `Категорiя`) VALUES
(2, 5210, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', 15.51, 'BHV С.-Петербург', 400, '70х100/16', '2000-07-24', 50000, 'Використання ПК в цілому', 'Підручники'),
(8, 4895, 'No', 'Освой самостоятельно модернизацию и ремонт ПК за 24 часа, 2-е изд.', 18.90, 'Вильямс', 288, '70х100/16', '2000-07-07', 50000, 'Використання ПК в цілому', 'Підручники'),
(9, 5141, 'No', 'Структуры данных и алгоритмы.', 37.80, 'Вильямс', 384, '70х100/16', '2000-09-29', 50000, 'Використання ПК в цілому', 'Підручники'),
(20, 5127, 'Yes', 'Автоматизация инженерно- графических работ', 11.58, 'Питер', 256, '70х100/16', '2000-06-15', 50000, 'Використання ПК в цілому', 'Підручники'),
(31, 5110, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', 15.51, 'BHV С.-Петербург', 400, '70х100/16', '2000-07-24', 50000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(46, 5199, 'No', 'Железо IBM 2001. ', 30.07, 'МикроАрт', 368, '70х100/16', '2000-02-12', 50000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(50, 3851, 'Yes', 'Защита информации и безопасность компьютерных систем', 26.00, 'DiaSoft', 480, '84х108/16', '1999-02-04', 50000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(58, 3932, 'No', 'Как превратить персональный компьютер в измерительный комплекс', 7.65, 'ДМК', 144, '60х88/16', '1999-09-06', 50000, 'Використання ПК в цілому', 'Інші книги'),
(59, 4713, 'No', 'Plug- ins. Встраиваемые приложения для музыкальных программ', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22', 50000, 'Використання ПК в цілому', 'Інші книги'),
(175, 5217, 'No', 'Windows МЕ. Новейшие версии программ', 16.57, 'Триумф', 320, '70х100/16', '2000-08-25', 50000, 'Операційні системи', 'Windows 2000'),
(176, 4829, 'No', 'Windows 2000 Professional шаг за шагом с СD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28', 50000, 'Операційні системи', 'Windows 2000'),
(188, 5170, 'No', 'Linux Русские версии', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29', 50000, 'Операційні системи', 'Linux'),
(191, 860, 'No', 'Операционная система UNIX', 3.50, 'BHV С.-Петербург', 395, '84х100/16', '1997-05-05', 50000, 'Операційні системи', 'Unix'),
(203, 44, 'No', 'Ответы на актуальные вопросы по OS/2 Warp', 5.00, 'DiaSoft', 352, '60х84/16', '1996-03-20', 50000, 'Операційні системи', 'Інші операційні системи'),
(206, 5176, 'No', 'Windows Ме. Спутник пользователя', 12.79, 'Русская редакция', 306, '', '2000-10-10', 50000, 'Операційні системи', 'Інші операційні системи'),
(209, 5462, 'No', 'Язык программирования С++. Лекции и упражнения', 29.00, 'DiaSoft', 656, '84х108/16', '2000-12-12', 50000, 'Програмування', 'C&C++'),
(210, 4982, 'No', 'Язык программирования С. Лекции и упражнения', 29.00, 'DiaSoft', 432, '84х108/16', '2000-07-12', 50000, 'Програмування', 'C&C++'),
(220, 4687, 'No', 'Эффективное использование C++ .50 рекомендаций по улучшению ваших программ и проектов', 17.60, 'ДМК', 240, '70х100/16', '2000-02-03', 50000, 'Програмування', 'C&C++'),
(227, 1487, 'Yes', 'Відьмак. Вежа Ластівки.', 5.35, 'КСД', 480, '84×108/32', '2016-01-01', 11000, 'Фентезi', 'Пригодницька література'),
(228, 1489, 'Yes', 'Відьмак. Володарка Озера', 5.30, 'КСД', NULL, NULL, '2021-03-02', NULL, NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `table_1`
--
ALTER TABLE `table_1`
  ADD PRIMARY KEY (`N`),
  ADD UNIQUE KEY `Код` (`Код`),
  ADD UNIQUE KEY `indx_test` (`Код`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
