# 141, Суптеля Владислав
# 【Дата】:「09.03.20」
# 6. Написати рекурсивну процедуру перекладу натурального числа з десяткової системи числення в N-річної.
# Значення N в основній програмі вводиться з клавіатури (2 ≤ N ≤ 16).

n = int(input("「Введите число」: "))
a = int(input("「Введите основание системы счисления」: "))
def rashinban(n, a):
    if not 2 <= a <= 16:
        quit(print("  0_o \n  wwww "))
    elif a == 2:
        print(bin(n))
    elif a == 8:
        print(oct(n))
    elif a == 10:
        print('Смысл? . . \n' + str(n))
    elif a == 16:
        print(hex(n))
    else:                               #потому что я не мазохист
        print("Поддерживаются только позиционные системы исчисления в составе двоичной, восьмеричной, десятичной и шестнадцатеричной!")
rashinban(n, a)
# >o_o>
#def boon(n, a):
#    print(int(str(n), a))
#boon(n, a)
# http://pro-chislo.ru/perevod-sistem-schislenija
