# 141, Суптеля Владислав
# 【Дата】:「09.03.20」
# 7. Написати рекурсивну функцію, що визначає, чи є симетричною частина рядка S, починаючи з i-го елемента і закінчуючи j-м.

def simline(S, i, j):
    if (i == j or j-1 == i):                       # парное или непарное кол-во элементов
        return 1                                   # тру
    if S[i] == S[j]:
        return simline(S, i+1, j-1)                # с каждой итерацией сдвигаемся на элемент вправо с левой и в лево с правой (к центру)
    return 0
S = input("「Введите строку」: ")
i = int(input("「Введите начало среза」: "))-1      # вводим от 1, а читается эл с 0-вым индексом
j = int(input("「Введите конец среза」: "))-1       # аналогично
if simline(S, i, j):
    print("Срез симметричен.")
else:
    print("Срез не симметричен.")
