# 141, Суптеля Владислав
# 【Дата】:「09.03.20」
# 14. Дано натуральне число N. Виведіть слово YES, якщо число N є точним ступенем двійки, або слово NO в іншому випадку.

n = int(input("「Введите число」: "))
def simp(n):
    while n > 1 and n % 2 == 0:
        n /= 2
    if n == 1:
        print("yes")
    else:
        print("no")
simp(n)

