# 141, Суптеля Владислав
# 【Дата】:「19.03.20」
# 9. Використовуючи словники, написати програму додавання і множення двох комплексних чисел.

a = {'real': float(input("Вещественная часть 1-ого числа: ")), 'imaginary': float(input("Мнимая часть 1-ого числа: "))}
a = (complex(a['real'], a['imaginary']))
b = {'real': float(input("Вещественная часть 2-ого числа: ")), 'imaginary': float(input("Мнимая часть 2-ого числа: "))}
b = (complex(b['real'], b['imaginary']))
c_sum = a + b
c_mult = a * b
print(" Результат сложения: {0} \n Результат умножения: {1}".format(c_sum, c_mult))
