# 141, Суптеля Владислав
# 【Дата】:「19.03.20」
# 12. У вхідному файлі записано текст. Словом вважається послідовність непробельний символів, що йдуть підряд,
# слова розділені одним або більшим числом прогалин або символами кінця рядка. Визначте, скільки різних слів міститься в цьому тексті.

# print("Количество слов в файле: ", len(open(r'tz12.txt').read().split()))
print("Количество уникальных слов в файле: ", len(set(open(r'tz12.txt').read().split())))
# количество слов в фалйе по версии Word: 63 (с повторениями)
# вывод: 63, 51 без повторений (54 до удаления всех знаков препинания)
# r'tz12.txt' == 'tz12.txt', 'r'

# with open('tz12.txt') as file:
#     kotoba = file.read().split()
# kotoba = list(kotoba)
# kotoba = sorted(kotoba)
# print(kotoba)
# print(sorted((set(kotoba))))
