/*
Автор проекту: Суптеля Владислав
Дата: 18.10.2019
18.Введіть з клавіатури ціле число від 1 до 100. У разі введення неправильного значення надрукуйте повідомлення про помилку на екрані і завершите виконання програми.
*/

#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	int x;
	cout << "Введите число в диапазоне от 1 до 100 . . ." << endl;
	cin >> x;
	if (x < 1 || x > 100)
	{
		MessageBox(NULL, "Вне диапазона.", "Ошибка", MB_OK);
		return 0;
	}
	else return 0;
}

//