/*
Автор проекту: Суптеля Владислав
Дата: 04.11.2019
1. Яким буде значення х після завершення циклу for? for (int x = 0; x <100; x ++);
2  Напишіть вкладений цикл for, що друкує картинку з нулів 10х10.
*/
#include <iostream>
using namespace std;

/* #1
int main()
{
	for (int x = 0; x < 100; x++)
	{
		cout << x << " ";
	}
}
//х постепенно увеличивает своё значение от 0 до 100, после чего цикл завершается и переменная исчезает:
//0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99
*/
int main()
{
	for (int i = 0; i < 10; i++)
	{
		for (int j = 0; j < 10; j++)
			cout << "0 ";
		cout << endl;
	}
	system("pause");
}