# 141, Суптеля Владислав
# Дата: 19.02.20
# 1. Дана сторона квадрата a. Знайти його периметр P=4·a.

a = int(input("a = "))
a > 0
P = 4 * a
print("P =", P)
