# 141, Суптеля Владислав
# Дата: 19.02.20
# 2. Дана сторона квадрата a. Знайти його площу S=a^2.

a = int(input("a = "))
a > 0
S = a ** 2
print("S =", S)
