# 141, Суптеля Владислав
# Дата: 20.02.20
# 15. Дано змінні A, B, C. Змінити їх значення, перемістивши вміст A в B, B - в C, C - в A, і вивести нові значення змінних A, B, C.

a, b, c = map(int, input("Введите значения「a」, 「b」, 「c」: ").split())
a,b,c = b,c,a
print("【a】 = {0}, 【b】 = {1}, 【c】 = {2}".format(a, b, c))
