# 141, Суптеля Владислав
# Дата: 20.02.20
# 17. Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
# Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один одному.
# Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого автомобілями;
# загальний шлях = час · сумарна швидкість.

print("Умова: Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км. Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один одному.")
a, b, s, t = map(int, input("Значення「V1」(км/год), 「V2」(км/год), 「S」(км), 「T」(год): ").split())
print("Загальний (пройдений) шлях:【{2} км】. Вiдстань мiж автомобiлями [через {0} год]:【{1} км】.".format(t, abs(s-(t*(a+b))), t*(a+b)))
