# 141, Суптеля Владислав
# 【Дата】:「03.03.20」
# 12. Перевірити, чи є число досконалим.

def isPerfect():
    answ = []                                   # массив с ответом
    s = 1
    i = 2
    while i <= g // 2:
        if g % i == 0:
            s += i
            answ.append(str(i))                 # добавление в массив нового элементика
        i += 1
    answer = "1"                                # создание нового стринга (нада красивый ответ)
    i = 0                                       # патамуша новый ФОР
    for i in range(len(answ)):                  # до размера всего листа
        answer += "+"+answ[i]                   # добавляем всё из ансв в стринг
    print("{0} == {1}".format(answer, s))
    if g == s:
        print("{0} == {1}".format(g, s))
        print("Da.")
    else:
        print("{0} =/= {1}".format(g, s))
        print("Nyet.")
g = int(input("Davai davai . . . \n"))
isPerfect()
# Таблиця ДЧ
# 6
# 28
# 496
# 8128
# 33 550 336
# 8 589 869 056
# 137 438 691 328
# 2 305 843 008 139 952 128
# 2 658 455 991 569 831 744 654 692 615 953 842 176
# 191 561 942 608 236 107 294 793 378 084 303 638 130 997 321 548 169 216

