# 141, Суптеля Владислав
# 【Дата】:「03.03.20」
# 17. Перевірити, чи є пропозиція паліндромом.

def isPalindrome():
    s = input("Очiкування вводу . . . ")
    l = len(s)                                  # длина строки логично окда
    a = 1                                       # тупой счётчик на переменичах (1 = да, 0 = нет)
    for i in range(l//2):
        if s[i] != s[-1-i]:                     # сравниваем соответствующие символы на концах
            a = 0                               # счётчик в деле
            i = l                               # почти что квит (дрифт из фора)
    if a == 1:
        print("Так, це палiндром.")
    else:
        print("Нi, це не палiндром.")
isPalindrome()
