/*
Автор проекту: Суптеля Владислав
Дата: 18.10.2019
10.У чому відмінність між x = 3 і x = = 3?
11.Чи правильне наступне перерахування: enum bool {TRUE, FALSE};
12.Поясніть чому еквівалентні наступні оператори:
a) if (x) x = 0; і if (x! = 0) x = 0;
b) if (! x) x = 1; і if (x = = 0) x = 1;
*/

#include <iostream>
using namespace std;

int main()
{
	// 10

	/*int x;
	x = 3; x == 3; */ // = -> присвоение, == -> равенство (сравнение, bool: если x=3 то выражение true)

	// 11
	// enum bool{ TRUE, FALSE }; -> мы не можем использовать уже задекларированные имена

	// 12
	int x;
	if (x) x = 0; if (x!= 0) x = 0; // если значение х не 0, то ему присваиваем 0 == если х не равен 0, то присваиваем иксу 0
	if (!x) x = 1; if (x == 0) x = 1; // если х = 0, то присваиваем иксу 1 == если х равен 0, то присваиеваем иксу 1
	system("pause");
	return 0;
}